# ----------------------------------------------------------------------------
#  Hyper Operating System V4 Advance
#
#                                    Copyright (C) 1998-2007 by Project HOS
#                                    http://sourceforge.jp/projects/hos/
# ----------------------------------------------------------------------------


				.text

# --------------------------------------------------
#  実行コンテキストの作成
#  _kernel_cre_ctx(
#		_KERNEL_T_CTXCB *pk_ctxcb,				作成するコンテキスト [r6]
#		VP              isp,					初期スタックポインタ [r7]
#		FP              entry,					実行アドレス         [r8]
#		VP_INT          par1,					実行時パラメータ1    [r9]
#		VP_INT          par2)					実行時パラメータ2    0[sp]
# --------------------------------------------------
				.globl	__kernel_cre_ctx
__kernel_cre_ctx:
				ld.w	0 [sp], r10			-- 実行時パラメータ2取り出し
				add 	-44, r7				-- スタックに領域を確保
				st.w	r8,  4 * 0  [r7]	-- 実行アドレスを      r20 の領域に設定
				st.w	r9,  4 * 1  [r7]	-- 実行時パラメータ1を r21 の領域に設定
				st.w	r10, 4 * 2  [r7]	-- 実行時パラメータ2を r22 の領域に設定
				movea	ctx_entry, tp, r10
				st.w	r10, 4 * 10 [r7]	-- 実行時パラメータ2を r22 の領域に設定
				jmp		[lp]


# --------------------------------------------------
#  実行コンテキストエントリーアドレス
# --------------------------------------------------
ctx_entry:	 	
				mov		r21, r6				-- 実行時パラメータ1を設定
				mov		r22, r7				-- 実行時パラメータ2を設定(遅延スロット)
				jmp		[r20]				-- 実行開始アドレスに分岐



# end of file
